INSERT INTO goblog.blog_post (pid, title, content, markdown, category_id, user_id, view_count, type, slug, create_at, update_at) VALUES (7, 'go博客实战', '<blockquote>
<p>现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。</p>
</blockquote>
<p>针对现今行业的现状，程序员面临的三个大问题：</p>
<ul>
<li><p><strong>学习</strong></p>
<p>学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为<code>无效学习</code>。</p>
</li><li><p><strong>进阶</strong></p>
<p>因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。</p>
<p>不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。</p>
<p>上述的这些情况，我称为是<code>迷途的羔羊</code>。</p>
</li><li><p><strong>面试</strong></p>
<p>面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。</p>
<p>面试靠什么？</p>
<p>一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。</p>
<p>二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。</p>
<p>三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。</p>
<p>四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。</p>
<p>机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。</p>
<p>这种情况我称为<code>战前准备不足</code></p>
</li></ul>
<blockquote>
<p>针对以上情况，提供了一些核心服务</p>
</blockquote>
<ul>
<li><strong>会员服务(一年期)</strong><ul>
<li>任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止</li><li>任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等</li><li>详情介绍请看<a href="/pay/vip.md">会员服务详细介绍</a>了解</li></ul>
</li><li><strong>进阶付费课程</strong><ul>
<li>码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看<a href="/pay/xt.md">码神学堂项目实战教程详细介绍</a>了解</li><li>码神RPC（从零开发一个RPC框架） 详情介绍请看<a href="/pay/rpc.md">码神RPC详细介绍</a>了解</li><li>码神Spring（从零开发一个Spring框架）详情介绍请看<a href="/pay/spring.md">码神Spring详细介绍</a>了解</li><li>架构师课程-全面认知技术世界（制作中）详情介绍请看<a href="/pay/svip.md">架构师课程详细介绍</a>了解<ul>
<li>第一篇章-全面认识计算机</li><li>第二篇章-全面认识语言</li><li>第三篇章-全面认识架构</li></ul>
</li><li>Go游戏实战教程（制作中）详情介绍请看<a href="/pay/game.md">go游戏实战教程详细介绍</a>了解</li><li>码神MQ（从零开发MQ中间件 制作中）</li><li>能造轮子的尽量都造一遍…</li><li>如果想多个套餐一起买，可以看<a href="/pay/tc.md">套餐组合优惠详细介绍</a></li></ul>
</li><li><strong>终身会员(即将涨价)</strong><ul>
<li>买断制，所有已出和未出的付费课程和项目</li><li>终身会员服务，终身答疑指导</li><li>一对一模拟面试</li><li>等等</li></ul>
</li><li><strong>go开发Offer收割社群</strong> <ul>
<li>Go全套资料，包含学习，面试真题等等</li><li>一对一模拟面试，多次</li><li>模拟面试通过可获内推，跟踪整个流程</li><li>终身服务</li><li>详情介绍请看<a href="/pay/go.md">go开发offer收割社群详细介绍</a>了解</li></ul>
</li></ul>
<blockquote>
<p>如有意向，可联系我了解详情</p>
</blockquote>
<p><img src="./img/image-20220215214357342.png" alt="image-20220215214357342"></p>
', '
> 现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。



针对现今行业的现状，程序员面临的三个大问题：

* **学习**

  学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为`无效学习`。

* **进阶**

  因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。

  不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。

  上述的这些情况，我称为是`迷途的羔羊`。

* **面试**

  面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。

  面试靠什么？

  一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。

  二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。

  三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。

  四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。

  机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。

  这种情况我称为`战前准备不足`



> 针对以上情况，提供了一些核心服务

* **会员服务(一年期)**
  * 任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止
  * 任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等
  * 详情介绍请看[会员服务详细介绍](/pay/vip.md)了解
* **进阶付费课程**
  * 码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看[码神学堂项目实战教程详细介绍](/pay/xt.md)了解
  * 码神RPC（从零开发一个RPC框架） 详情介绍请看[码神RPC详细介绍](/pay/rpc.md)了解
  * 码神Spring（从零开发一个Spring框架）详情介绍请看[码神Spring详细介绍](/pay/spring.md)了解
  * 架构师课程-全面认知技术世界（制作中）详情介绍请看[架构师课程详细介绍](/pay/svip.md)了解
    * 第一篇章-全面认识计算机
    * 第二篇章-全面认识语言
    * 第三篇章-全面认识架构
  * Go游戏实战教程（制作中）详情介绍请看[go游戏实战教程详细介绍](/pay/game.md)了解
  * 码神MQ（从零开发MQ中间件 制作中）
  * 能造轮子的尽量都造一遍...
  * 如果想多个套餐一起买，可以看[套餐组合优惠详细介绍](/pay/tc.md)
* **终身会员(即将涨价)**
  * 买断制，所有已出和未出的付费课程和项目
  * 终身会员服务，终身答疑指导
  * 一对一模拟面试
  * 等等
* **go开发Offer收割社群** 
  * Go全套资料，包含学习，面试真题等等
  * 一对一模拟面试，多次
  * 模拟面试通过可获内推，跟踪整个流程
  * 终身服务
  * 详情介绍请看[go开发offer收割社群详细介绍](/pay/go.md)了解

> 如有意向，可联系我了解详情

![image-20220215214357342](./img/image-20220215214357342.png)

', 1, 1, 0, 0, 'golang', '2022-02-18 00:05:41', '2022-02-18 00:05:41');
INSERT INTO goblog.blog_post (pid, title, content, markdown, category_id, user_id, view_count, type, slug, create_at, update_at) VALUES (19, 'go博客实战123', '<blockquote>
<p>现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。</p>
</blockquote>
<p>针对现今行业的现状，程序员面临的三个大问题：</p>
<ul>
<li><p><strong>学习</strong></p>
<p>学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为<code>无效学习</code>。</p>
</li><li><p><strong>进阶</strong></p>
<p>因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。</p>
<p>不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。</p>
<p>上述的这些情况，我称为是<code>迷途的羔羊</code>。</p>
</li><li><p><strong>面试</strong></p>
<p>面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。</p>
<p>面试靠什么？</p>
<p>一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。</p>
<p>二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。</p>
<p>三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。</p>
<p>四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。</p>
<p>机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。</p>
<p>这种情况我称为<code>战前准备不足</code></p>
</li></ul>
<blockquote>
<p>针对以上情况，提供了一些核心服务</p>
</blockquote>
<ul>
<li><strong>会员服务(一年期)</strong><ul>
<li>任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止</li><li>任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等</li><li>详情介绍请看<a href="/pay/vip.md">会员服务详细介绍</a>了解</li></ul>
</li><li><strong>进阶付费课程</strong><ul>
<li>码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看<a href="/pay/xt.md">码神学堂项目实战教程详细介绍</a>了解</li><li>码神RPC（从零开发一个RPC框架） 详情介绍请看<a href="/pay/rpc.md">码神RPC详细介绍</a>了解</li><li>码神Spring（从零开发一个Spring框架）详情介绍请看<a href="/pay/spring.md">码神Spring详细介绍</a>了解</li><li>架构师课程-全面认知技术世界（制作中）详情介绍请看<a href="/pay/svip.md">架构师课程详细介绍</a>了解<ul>
<li>第一篇章-全面认识计算机</li><li>第二篇章-全面认识语言</li><li>第三篇章-全面认识架构</li></ul>
</li><li>Go游戏实战教程（制作中）详情介绍请看<a href="/pay/game.md">go游戏实战教程详细介绍</a>了解</li><li>码神MQ（从零开发MQ中间件 制作中）</li><li>能造轮子的尽量都造一遍…</li><li>如果想多个套餐一起买，可以看<a href="/pay/tc.md">套餐组合优惠详细介绍</a></li></ul>
</li><li><strong>终身会员(即将涨价)</strong><ul>
<li>买断制，所有已出和未出的付费课程和项目</li><li>终身会员服务，终身答疑指导</li><li>一对一模拟面试</li><li>等等</li></ul>
</li><li><strong>go开发Offer收割社群</strong> <ul>
<li>Go全套资料，包含学习，面试真题等等</li><li>一对一模拟面试，多次</li><li>模拟面试通过可获内推，跟踪整个流程</li><li>终身服务</li><li>详情介绍请看<a href="/pay/go.md">go开发offer收割社群详细介绍</a>了解</li></ul>
</li></ul>
<blockquote>
<p>如有意向，可联系我了解详情</p>
</blockquote>
<p><img src="./img/image-20220215214357342.png" alt="image-20220215214357342"></p>
', '
> 现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。



针对现今行业的现状，程序员面临的三个大问题：

* **学习**

  学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为`无效学习`。

* **进阶**

  因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。

  不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。

  上述的这些情况，我称为是`迷途的羔羊`。

* **面试**

  面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。

  面试靠什么？

  一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。

  二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。

  三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。

  四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。

  机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。

  这种情况我称为`战前准备不足`



> 针对以上情况，提供了一些核心服务

* **会员服务(一年期)**
  * 任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止
  * 任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等
  * 详情介绍请看[会员服务详细介绍](/pay/vip.md)了解
* **进阶付费课程**
  * 码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看[码神学堂项目实战教程详细介绍](/pay/xt.md)了解
  * 码神RPC（从零开发一个RPC框架） 详情介绍请看[码神RPC详细介绍](/pay/rpc.md)了解
  * 码神Spring（从零开发一个Spring框架）详情介绍请看[码神Spring详细介绍](/pay/spring.md)了解
  * 架构师课程-全面认知技术世界（制作中）详情介绍请看[架构师课程详细介绍](/pay/svip.md)了解
    * 第一篇章-全面认识计算机
    * 第二篇章-全面认识语言
    * 第三篇章-全面认识架构
  * Go游戏实战教程（制作中）详情介绍请看[go游戏实战教程详细介绍](/pay/game.md)了解
  * 码神MQ（从零开发MQ中间件 制作中）
  * 能造轮子的尽量都造一遍...
  * 如果想多个套餐一起买，可以看[套餐组合优惠详细介绍](/pay/tc.md)
* **终身会员(即将涨价)**
  * 买断制，所有已出和未出的付费课程和项目
  * 终身会员服务，终身答疑指导
  * 一对一模拟面试
  * 等等
* **go开发Offer收割社群** 
  * Go全套资料，包含学习，面试真题等等
  * 一对一模拟面试，多次
  * 模拟面试通过可获内推，跟踪整个流程
  * 终身服务
  * 详情介绍请看[go开发offer收割社群详细介绍](/pay/go.md)了解

> 如有意向，可联系我了解详情

![image-20220215214357342](./img/image-20220215214357342.png)

', 1, 1, 0, 0, '', '2022-02-18 00:08:45', '2022-02-18 00:08:45');
INSERT INTO goblog.blog_post (pid, title, content, markdown, category_id, user_id, view_count, type, slug, create_at, update_at) VALUES (20, 'go博客实战33', '<blockquote>
<p>现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。</p>
</blockquote>
<p>针对现今行业的现状，程序员面临的三个大问题：</p>
<ul>
<li><p><strong>学习</strong></p>
<p>学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为<code>无效学习</code>。</p>
</li><li><p><strong>进阶</strong></p>
<p>因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。</p>
<p>不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。</p>
<p>上述的这些情况，我称为是<code>迷途的羔羊</code>。</p>
</li><li><p><strong>面试</strong></p>
<p>面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。</p>
<p>面试靠什么？</p>
<p>一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。</p>
<p>二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。</p>
<p>三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。</p>
<p>四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。</p>
<p>机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。</p>
<p>这种情况我称为<code>战前准备不足</code></p>
</li></ul>
<blockquote>
<p>针对以上情况，提供了一些核心服务</p>
</blockquote>
<ul>
<li><strong>会员服务(一年期)</strong><ul>
<li>任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止</li><li>任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等</li><li>详情介绍请看<a href="/pay/vip.md">会员服务详细介绍</a>了解</li></ul>
</li><li><strong>进阶付费课程</strong><ul>
<li>码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看<a href="/pay/xt.md">码神学堂项目实战教程详细介绍</a>了解</li><li>码神RPC（从零开发一个RPC框架） 详情介绍请看<a href="/pay/rpc.md">码神RPC详细介绍</a>了解</li><li>码神Spring（从零开发一个Spring框架）详情介绍请看<a href="/pay/spring.md">码神Spring详细介绍</a>了解</li><li>架构师课程-全面认知技术世界（制作中）详情介绍请看<a href="/pay/svip.md">架构师课程详细介绍</a>了解<ul>
<li>第一篇章-全面认识计算机</li><li>第二篇章-全面认识语言</li><li>第三篇章-全面认识架构</li></ul>
</li><li>Go游戏实战教程（制作中）详情介绍请看<a href="/pay/game.md">go游戏实战教程详细介绍</a>了解</li><li>码神MQ（从零开发MQ中间件 制作中）</li><li>能造轮子的尽量都造一遍…</li><li>如果想多个套餐一起买，可以看<a href="/pay/tc.md">套餐组合优惠详细介绍</a></li></ul>
</li><li><strong>终身会员(即将涨价)</strong><ul>
<li>买断制，所有已出和未出的付费课程和项目</li><li>终身会员服务，终身答疑指导</li><li>一对一模拟面试</li><li>等等</li></ul>
</li><li><strong>go开发Offer收割社群</strong> <ul>
<li>Go全套资料，包含学习，面试真题等等</li><li>一对一模拟面试，多次</li><li>模拟面试通过可获内推，跟踪整个流程</li><li>终身服务</li><li>详情介绍请看<a href="/pay/go.md">go开发offer收割社群详细介绍</a>了解</li></ul>
</li></ul>
<blockquote>
<p>如有意向，可联系我了解详情</p>
</blockquote>
<p><img src="./img/image-20220215214357342.png" alt="image-20220215214357342"></p>
', '
> 现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。



针对现今行业的现状，程序员面临的三个大问题：

* **学习**

  学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为`无效学习`。

* **进阶**

  因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。

  不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。

  上述的这些情况，我称为是`迷途的羔羊`。

* **面试**

  面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。

  面试靠什么？

  一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。

  二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。

  三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。

  四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。

  机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。

  这种情况我称为`战前准备不足`



> 针对以上情况，提供了一些核心服务

* **会员服务(一年期)**
  * 任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止
  * 任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等
  * 详情介绍请看[会员服务详细介绍](/pay/vip.md)了解
* **进阶付费课程**
  * 码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看[码神学堂项目实战教程详细介绍](/pay/xt.md)了解
  * 码神RPC（从零开发一个RPC框架） 详情介绍请看[码神RPC详细介绍](/pay/rpc.md)了解
  * 码神Spring（从零开发一个Spring框架）详情介绍请看[码神Spring详细介绍](/pay/spring.md)了解
  * 架构师课程-全面认知技术世界（制作中）详情介绍请看[架构师课程详细介绍](/pay/svip.md)了解
    * 第一篇章-全面认识计算机
    * 第二篇章-全面认识语言
    * 第三篇章-全面认识架构
  * Go游戏实战教程（制作中）详情介绍请看[go游戏实战教程详细介绍](/pay/game.md)了解
  * 码神MQ（从零开发MQ中间件 制作中）
  * 能造轮子的尽量都造一遍...
  * 如果想多个套餐一起买，可以看[套餐组合优惠详细介绍](/pay/tc.md)
* **终身会员(即将涨价)**
  * 买断制，所有已出和未出的付费课程和项目
  * 终身会员服务，终身答疑指导
  * 一对一模拟面试
  * 等等
* **go开发Offer收割社群** 
  * Go全套资料，包含学习，面试真题等等
  * 一对一模拟面试，多次
  * 模拟面试通过可获内推，跟踪整个流程
  * 终身服务
  * 详情介绍请看[go开发offer收割社群详细介绍](/pay/go.md)了解

> 如有意向，可联系我了解详情

![image-20220215214357342](./img/image-20220215214357342.png)

', 2, 1, 0, 0, '', '2022-02-18 00:11:23', '2022-02-18 00:11:23');
INSERT INTO goblog.blog_post (pid, title, content, markdown, category_id, user_id, view_count, type, slug, create_at, update_at) VALUES (21, 'go博客实战5565', '<blockquote>
<p>现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。</p>
</blockquote>
<p>针对现今行业的现状，程序员面临的三个大问题：</p>
<ul>
<li><p><strong>学习</strong></p>
<p>学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为<code>无效学习</code>。</p>
</li><li><p><strong>进阶</strong></p>
<p>因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。</p>
<p>不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。</p>
<p>上述的这些情况，我称为是<code>迷途的羔羊</code>。</p>
</li><li><p><strong>面试</strong></p>
<p>面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。</p>
<p>面试靠什么？</p>
<p>一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。</p>
<p>二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。</p>
<p>三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。</p>
<p>四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。</p>
<p>机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。</p>
<p>这种情况我称为<code>战前准备不足</code></p>
</li></ul>
<blockquote>
<p>针对以上情况，提供了一些核心服务</p>
</blockquote>
<ul>
<li><strong>会员服务(一年期)</strong><ul>
<li>任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止</li><li>任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等</li><li>详情介绍请看<a href="/pay/vip.md">会员服务详细介绍</a>了解</li></ul>
</li><li><strong>进阶付费课程</strong><ul>
<li>码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看<a href="/pay/xt.md">码神学堂项目实战教程详细介绍</a>了解</li><li>码神RPC（从零开发一个RPC框架） 详情介绍请看<a href="/pay/rpc.md">码神RPC详细介绍</a>了解</li><li>码神Spring（从零开发一个Spring框架）详情介绍请看<a href="/pay/spring.md">码神Spring详细介绍</a>了解</li><li>架构师课程-全面认知技术世界（制作中）详情介绍请看<a href="/pay/svip.md">架构师课程详细介绍</a>了解<ul>
<li>第一篇章-全面认识计算机</li><li>第二篇章-全面认识语言</li><li>第三篇章-全面认识架构</li></ul>
</li><li>Go游戏实战教程（制作中）详情介绍请看<a href="/pay/game.md">go游戏实战教程详细介绍</a>了解</li><li>码神MQ（从零开发MQ中间件 制作中）</li><li>能造轮子的尽量都造一遍…</li><li>如果想多个套餐一起买，可以看<a href="/pay/tc.md">套餐组合优惠详细介绍</a></li></ul>
</li><li><strong>终身会员(即将涨价)</strong><ul>
<li>买断制，所有已出和未出的付费课程和项目</li><li>终身会员服务，终身答疑指导</li><li>一对一模拟面试</li><li>等等</li></ul>
</li><li><strong>go开发Offer收割社群</strong> <ul>
<li>Go全套资料，包含学习，面试真题等等</li><li>一对一模拟面试，多次</li><li>模拟面试通过可获内推，跟踪整个流程</li><li>终身服务</li><li>详情介绍请看<a href="/pay/go.md">go开发offer收割社群详细介绍</a>了解</li></ul>
</li></ul>
<blockquote>
<p>如有意向，可联系我了解详情</p>
</blockquote>
<p><img src="./img/image-20220215214357342.png" alt="image-20220215214357342"></p>
', '
> 现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。



针对现今行业的现状，程序员面临的三个大问题：

* **学习**

  学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为`无效学习`。

* **进阶**

  因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。

  不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。

  上述的这些情况，我称为是`迷途的羔羊`。

* **面试**

  面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。

  面试靠什么？

  一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。

  二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。

  三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。

  四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。

  机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。

  这种情况我称为`战前准备不足`



> 针对以上情况，提供了一些核心服务

* **会员服务(一年期)**
  * 任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止
  * 任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等
  * 详情介绍请看[会员服务详细介绍](/pay/vip.md)了解
* **进阶付费课程**
  * 码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看[码神学堂项目实战教程详细介绍](/pay/xt.md)了解
  * 码神RPC（从零开发一个RPC框架） 详情介绍请看[码神RPC详细介绍](/pay/rpc.md)了解
  * 码神Spring（从零开发一个Spring框架）详情介绍请看[码神Spring详细介绍](/pay/spring.md)了解
  * 架构师课程-全面认知技术世界（制作中）详情介绍请看[架构师课程详细介绍](/pay/svip.md)了解
    * 第一篇章-全面认识计算机
    * 第二篇章-全面认识语言
    * 第三篇章-全面认识架构
  * Go游戏实战教程（制作中）详情介绍请看[go游戏实战教程详细介绍](/pay/game.md)了解
  * 码神MQ（从零开发MQ中间件 制作中）
  * 能造轮子的尽量都造一遍...
  * 如果想多个套餐一起买，可以看[套餐组合优惠详细介绍](/pay/tc.md)
* **终身会员(即将涨价)**
  * 买断制，所有已出和未出的付费课程和项目
  * 终身会员服务，终身答疑指导
  * 一对一模拟面试
  * 等等
* **go开发Offer收割社群** 
  * Go全套资料，包含学习，面试真题等等
  * 一对一模拟面试，多次
  * 模拟面试通过可获内推，跟踪整个流程
  * 终身服务
  * 详情介绍请看[go开发offer收割社群详细介绍](/pay/go.md)了解

> 如有意向，可联系我了解详情

![image-20220215214357342](./img/image-20220215214357342.png)

', 1, 1, 0, 0, 'golang', '2022-02-18 12:18:26', '2022-02-18 12:18:26');
INSERT INTO goblog.blog_post (pid, title, content, markdown, category_id, user_id, view_count, type, slug, create_at, update_at) VALUES (22, 'go博客实战update', '<blockquote>
<p>现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。</p>
</blockquote>
<p>针对现今行业的现状，程序员面临的三个大问题：</p>
<ul>
<li><p><strong>学习</strong></p>
<p>学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为<code>无效学习</code>。</p>
</li><li><p><strong>进阶</strong></p>
<p>因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。</p>
<p>不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。</p>
<p>上述的这些情况，我称为是<code>迷途的羔羊</code>。</p>
</li><li><p><strong>面试</strong></p>
<p>面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。</p>
<p>面试靠什么？</p>
<p>一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。</p>
<p>二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。</p>
<p>三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。</p>
<p>四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。</p>
<p>机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。</p>
<p>这种情况我称为<code>战前准备不足</code></p>
</li></ul>
<blockquote>
<p>针对以上情况，提供了一些核心服务</p>
</blockquote>
<ul>
<li><strong>会员服务(一年期)</strong><ul>
<li>任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止</li><li>任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等</li><li>详情介绍请看<a href="/pay/vip.md">会员服务详细介绍</a>了解</li></ul>
</li><li><strong>进阶付费课程</strong><ul>
<li>码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看<a href="/pay/xt.md">码神学堂项目实战教程详细介绍</a>了解</li><li>码神RPC（从零开发一个RPC框架） 详情介绍请看<a href="/pay/rpc.md">码神RPC详细介绍</a>了解</li><li>码神Spring（从零开发一个Spring框架）详情介绍请看<a href="/pay/spring.md">码神Spring详细介绍</a>了解</li><li>架构师课程-全面认知技术世界（制作中）详情介绍请看<a href="/pay/svip.md">架构师课程详细介绍</a>了解<ul>
<li>第一篇章-全面认识计算机</li><li>第二篇章-全面认识语言</li><li>第三篇章-全面认识架构</li></ul>
</li><li>Go游戏实战教程（制作中）详情介绍请看<a href="/pay/game.md">go游戏实战教程详细介绍</a>了解</li><li>码神MQ（从零开发MQ中间件 制作中）</li><li>能造轮子的尽量都造一遍…</li><li>如果想多个套餐一起买，可以看<a href="/pay/tc.md">套餐组合优惠详细介绍</a></li></ul>
</li><li><strong>终身会员(即将涨价)</strong><ul>
<li>买断制，所有已出和未出的付费课程和项目</li><li>终身会员服务，终身答疑指导</li><li>一对一模拟面试</li><li>等等</li></ul>
</li><li><strong>go开发Offer收割社群</strong> <ul>
<li>Go全套资料，包含学习，面试真题等等</li><li>一对一模拟面试，多次</li><li>模拟面试通过可获内推，跟踪整个流程</li><li>终身服务</li><li>详情介绍请看<a href="/pay/go.md">go开发offer收割社群详细介绍</a>了解</li></ul>
</li></ul>
<blockquote>
<p>如有意向，可联系我了解详情</p>
</blockquote>
<p><img src="./img/image-20220215214357342.png" alt="image-20220215214357342"></p>
', '
> 现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。



针对现今行业的现状，程序员面临的三个大问题：

* **学习**

  学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为`无效学习`。

* **进阶**

  因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。

  不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。

  上述的这些情况，我称为是`迷途的羔羊`。

* **面试**

  面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。

  面试靠什么？

  一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。

  二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。

  三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。

  四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。

  机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。

  这种情况我称为`战前准备不足`



> 针对以上情况，提供了一些核心服务

* **会员服务(一年期)**
  * 任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止
  * 任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等
  * 详情介绍请看[会员服务详细介绍](/pay/vip.md)了解
* **进阶付费课程**
  * 码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看[码神学堂项目实战教程详细介绍](/pay/xt.md)了解
  * 码神RPC（从零开发一个RPC框架） 详情介绍请看[码神RPC详细介绍](/pay/rpc.md)了解
  * 码神Spring（从零开发一个Spring框架）详情介绍请看[码神Spring详细介绍](/pay/spring.md)了解
  * 架构师课程-全面认知技术世界（制作中）详情介绍请看[架构师课程详细介绍](/pay/svip.md)了解
    * 第一篇章-全面认识计算机
    * 第二篇章-全面认识语言
    * 第三篇章-全面认识架构
  * Go游戏实战教程（制作中）详情介绍请看[go游戏实战教程详细介绍](/pay/game.md)了解
  * 码神MQ（从零开发MQ中间件 制作中）
  * 能造轮子的尽量都造一遍...
  * 如果想多个套餐一起买，可以看[套餐组合优惠详细介绍](/pay/tc.md)
* **终身会员(即将涨价)**
  * 买断制，所有已出和未出的付费课程和项目
  * 终身会员服务，终身答疑指导
  * 一对一模拟面试
  * 等等
* **go开发Offer收割社群** 
  * Go全套资料，包含学习，面试真题等等
  * 一对一模拟面试，多次
  * 模拟面试通过可获内推，跟踪整个流程
  * 终身服务
  * 详情介绍请看[go开发offer收割社群详细介绍](/pay/go.md)了解

> 如有意向，可联系我了解详情

![image-20220215214357342](./img/image-20220215214357342.png)

', 1, 1, 0, 0, '', '2022-02-18 12:18:42', '2022-02-18 12:18:58');
INSERT INTO goblog.blog_post (pid, title, content, markdown, category_id, user_id, view_count, type, slug, create_at, update_at) VALUES (23, 'go博客实战update11', '<blockquote>
<p>现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。</p>
</blockquote>
<p>针对现今行业的现状，程序员面临的三个大问题：</p>
<ul>
<li><p><strong>学习</strong></p>
<p>学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为<code>无效学习</code>。</p>
</li><li><p><strong>进阶</strong></p>
<p>因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。</p>
<p>不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。</p>
<p>上述的这些情况，我称为是<code>迷途的羔羊</code>。</p>
</li><li><p><strong>面试</strong></p>
<p>面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。</p>
<p>面试靠什么？</p>
<p>一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。</p>
<p>二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。</p>
<p>三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。</p>
<p>四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。</p>
<p>机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。</p>
<p>这种情况我称为<code>战前准备不足</code></p>
</li></ul>
<blockquote>
<p>针对以上情况，提供了一些核心服务</p>
</blockquote>
<ul>
<li><strong>会员服务(一年期)</strong><ul>
<li>任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止</li><li>任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等</li><li>详情介绍请看<a href="/pay/vip.md">会员服务详细介绍</a>了解</li></ul>
</li><li><strong>进阶付费课程</strong><ul>
<li>码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看<a href="/pay/xt.md">码神学堂项目实战教程详细介绍</a>了解</li><li>码神RPC（从零开发一个RPC框架） 详情介绍请看<a href="/pay/rpc.md">码神RPC详细介绍</a>了解</li><li>码神Spring（从零开发一个Spring框架）详情介绍请看<a href="/pay/spring.md">码神Spring详细介绍</a>了解</li><li>架构师课程-全面认知技术世界（制作中）详情介绍请看<a href="/pay/svip.md">架构师课程详细介绍</a>了解<ul>
<li>第一篇章-全面认识计算机</li><li>第二篇章-全面认识语言</li><li>第三篇章-全面认识架构</li></ul>
</li><li>Go游戏实战教程（制作中）详情介绍请看<a href="/pay/game.md">go游戏实战教程详细介绍</a>了解</li><li>码神MQ（从零开发MQ中间件 制作中）</li><li>能造轮子的尽量都造一遍…</li><li>如果想多个套餐一起买，可以看<a href="/pay/tc.md">套餐组合优惠详细介绍</a></li></ul>
</li><li><strong>终身会员(即将涨价)</strong><ul>
<li>买断制，所有已出和未出的付费课程和项目</li><li>终身会员服务，终身答疑指导</li><li>一对一模拟面试</li><li>等等</li></ul>
</li><li><strong>go开发Offer收割社群</strong> <ul>
<li>Go全套资料，包含学习，面试真题等等</li><li>一对一模拟面试，多次</li><li>模拟面试通过可获内推，跟踪整个流程</li><li>终身服务</li><li>详情介绍请看<a href="/pay/go.md">go开发offer收割社群详细介绍</a>了解</li></ul>
</li></ul>
<blockquote>
<p>如有意向，可联系我了解详情</p>
</blockquote>
<p><img src="./img/image-20220215214357342.png" alt="image-20220215214357342"></p>
', '
> 现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。



针对现今行业的现状，程序员面临的三个大问题：

* **学习**

  学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为`无效学习`。

* **进阶**

  因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。

  不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。

  上述的这些情况，我称为是`迷途的羔羊`。

* **面试**

  面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。

  面试靠什么？

  一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。

  二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。

  三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。

  四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。

  机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。

  这种情况我称为`战前准备不足`



> 针对以上情况，提供了一些核心服务

* **会员服务(一年期)**
  * 任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止
  * 任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等
  * 详情介绍请看[会员服务详细介绍](/pay/vip.md)了解
* **进阶付费课程**
  * 码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看[码神学堂项目实战教程详细介绍](/pay/xt.md)了解
  * 码神RPC（从零开发一个RPC框架） 详情介绍请看[码神RPC详细介绍](/pay/rpc.md)了解
  * 码神Spring（从零开发一个Spring框架）详情介绍请看[码神Spring详细介绍](/pay/spring.md)了解
  * 架构师课程-全面认知技术世界（制作中）详情介绍请看[架构师课程详细介绍](/pay/svip.md)了解
    * 第一篇章-全面认识计算机
    * 第二篇章-全面认识语言
    * 第三篇章-全面认识架构
  * Go游戏实战教程（制作中）详情介绍请看[go游戏实战教程详细介绍](/pay/game.md)了解
  * 码神MQ（从零开发MQ中间件 制作中）
  * 能造轮子的尽量都造一遍...
  * 如果想多个套餐一起买，可以看[套餐组合优惠详细介绍](/pay/tc.md)
* **终身会员(即将涨价)**
  * 买断制，所有已出和未出的付费课程和项目
  * 终身会员服务，终身答疑指导
  * 一对一模拟面试
  * 等等
* **go开发Offer收割社群** 
  * Go全套资料，包含学习，面试真题等等
  * 一对一模拟面试，多次
  * 模拟面试通过可获内推，跟踪整个流程
  * 终身服务
  * 详情介绍请看[go开发offer收割社群详细介绍](/pay/go.md)了解

> 如有意向，可联系我了解详情

![image-20220215214357342](./img/image-20220215214357342.png)

', 1, 1, 0, 0, '', '2022-02-18 12:19:15', '2022-02-18 12:19:15');
INSERT INTO goblog.blog_post (pid, title, content, markdown, category_id, user_id, view_count, type, slug, create_at, update_at) VALUES (24, 'go博客实战7777', '<blockquote>
<p>现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。</p>
</blockquote>
<p>针对现今行业的现状，程序员面临的三个大问题：</p>
<ul>
<li><p><strong>学习</strong></p>
<p>学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为<code>无效学习</code>。</p>
</li><li><p><strong>进阶</strong></p>
<p>因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。</p>
<p>不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。</p>
<p>上述的这些情况，我称为是<code>迷途的羔羊</code>。</p>
</li><li><p><strong>面试</strong></p>
<p>面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。</p>
<p>面试靠什么？</p>
<p>一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。</p>
<p>二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。</p>
<p>三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。</p>
<p>四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。</p>
<p>机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。</p>
<p>这种情况我称为<code>战前准备不足</code></p>
</li></ul>
<blockquote>
<p>针对以上情况，提供了一些核心服务</p>
</blockquote>
<ul>
<li><strong>会员服务(一年期)</strong><ul>
<li>任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止</li><li>任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等</li><li>详情介绍请看<a href="/pay/vip.md">会员服务详细介绍</a>了解</li></ul>
</li><li><strong>进阶付费课程</strong><ul>
<li>码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看<a href="/pay/xt.md">码神学堂项目实战教程详细介绍</a>了解</li><li>码神RPC（从零开发一个RPC框架） 详情介绍请看<a href="/pay/rpc.md">码神RPC详细介绍</a>了解</li><li>码神Spring（从零开发一个Spring框架）详情介绍请看<a href="/pay/spring.md">码神Spring详细介绍</a>了解</li><li>架构师课程-全面认知技术世界（制作中）详情介绍请看<a href="/pay/svip.md">架构师课程详细介绍</a>了解<ul>
<li>第一篇章-全面认识计算机</li><li>第二篇章-全面认识语言</li><li>第三篇章-全面认识架构</li></ul>
</li><li>Go游戏实战教程（制作中）详情介绍请看<a href="/pay/game.md">go游戏实战教程详细介绍</a>了解</li><li>码神MQ（从零开发MQ中间件 制作中）</li><li>能造轮子的尽量都造一遍…</li><li>如果想多个套餐一起买，可以看<a href="/pay/tc.md">套餐组合优惠详细介绍</a></li></ul>
</li><li><strong>终身会员(即将涨价)</strong><ul>
<li>买断制，所有已出和未出的付费课程和项目</li><li>终身会员服务，终身答疑指导</li><li>一对一模拟面试</li><li>等等</li></ul>
</li><li><strong>go开发Offer收割社群</strong> <ul>
<li>Go全套资料，包含学习，面试真题等等</li><li>一对一模拟面试，多次</li><li>模拟面试通过可获内推，跟踪整个流程</li><li>终身服务</li><li>详情介绍请看<a href="/pay/go.md">go开发offer收割社群详细介绍</a>了解</li></ul>
</li></ul>
<blockquote>
<p>如有意向，可联系我了解详情</p>
</blockquote>
<p><img src="./img/image-20220215214357342.png" alt="image-20220215214357342"></p>
', '
> 现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。



针对现今行业的现状，程序员面临的三个大问题：

* **学习**

  学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为`无效学习`。

* **进阶**

  因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。

  不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。

  上述的这些情况，我称为是`迷途的羔羊`。

* **面试**

  面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。

  面试靠什么？

  一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。

  二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。

  三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。

  四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。

  机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。

  这种情况我称为`战前准备不足`



> 针对以上情况，提供了一些核心服务

* **会员服务(一年期)**
  * 任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止
  * 任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等
  * 详情介绍请看[会员服务详细介绍](/pay/vip.md)了解
* **进阶付费课程**
  * 码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看[码神学堂项目实战教程详细介绍](/pay/xt.md)了解
  * 码神RPC（从零开发一个RPC框架） 详情介绍请看[码神RPC详细介绍](/pay/rpc.md)了解
  * 码神Spring（从零开发一个Spring框架）详情介绍请看[码神Spring详细介绍](/pay/spring.md)了解
  * 架构师课程-全面认知技术世界（制作中）详情介绍请看[架构师课程详细介绍](/pay/svip.md)了解
    * 第一篇章-全面认识计算机
    * 第二篇章-全面认识语言
    * 第三篇章-全面认识架构
  * Go游戏实战教程（制作中）详情介绍请看[go游戏实战教程详细介绍](/pay/game.md)了解
  * 码神MQ（从零开发MQ中间件 制作中）
  * 能造轮子的尽量都造一遍...
  * 如果想多个套餐一起买，可以看[套餐组合优惠详细介绍](/pay/tc.md)
* **终身会员(即将涨价)**
  * 买断制，所有已出和未出的付费课程和项目
  * 终身会员服务，终身答疑指导
  * 一对一模拟面试
  * 等等
* **go开发Offer收割社群** 
  * Go全套资料，包含学习，面试真题等等
  * 一对一模拟面试，多次
  * 模拟面试通过可获内推，跟踪整个流程
  * 终身服务
  * 详情介绍请看[go开发offer收割社群详细介绍](/pay/go.md)了解

> 如有意向，可联系我了解详情

![image-20220215214357342](./img/image-20220215214357342.png)

', 1, 1, 0, 0, '', '2022-02-18 12:19:26', '2022-02-18 12:19:26');
INSERT INTO goblog.blog_post (pid, title, content, markdown, category_id, user_id, view_count, type, slug, create_at, update_at) VALUES (25, 'go博客实战8888', '<blockquote>
<p>现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。</p>
</blockquote>
<p>针对现今行业的现状，程序员面临的三个大问题：</p>
<ul>
<li><p><strong>学习</strong></p>
<p>学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为<code>无效学习</code>。</p>
</li><li><p><strong>进阶</strong></p>
<p>因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。</p>
<p>不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。</p>
<p>上述的这些情况，我称为是<code>迷途的羔羊</code>。</p>
</li><li><p><strong>面试</strong></p>
<p>面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。</p>
<p>面试靠什么？</p>
<p>一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。</p>
<p>二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。</p>
<p>三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。</p>
<p>四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。</p>
<p>机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。</p>
<p>这种情况我称为<code>战前准备不足</code></p>
</li></ul>
<blockquote>
<p>针对以上情况，提供了一些核心服务</p>
</blockquote>
<ul>
<li><strong>会员服务(一年期)</strong><ul>
<li>任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止</li><li>任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等</li><li>详情介绍请看<a href="/pay/vip.md">会员服务详细介绍</a>了解</li></ul>
</li><li><strong>进阶付费课程</strong><ul>
<li>码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看<a href="/pay/xt.md">码神学堂项目实战教程详细介绍</a>了解</li><li>码神RPC（从零开发一个RPC框架） 详情介绍请看<a href="/pay/rpc.md">码神RPC详细介绍</a>了解</li><li>码神Spring（从零开发一个Spring框架）详情介绍请看<a href="/pay/spring.md">码神Spring详细介绍</a>了解</li><li>架构师课程-全面认知技术世界（制作中）详情介绍请看<a href="/pay/svip.md">架构师课程详细介绍</a>了解<ul>
<li>第一篇章-全面认识计算机</li><li>第二篇章-全面认识语言</li><li>第三篇章-全面认识架构</li></ul>
</li><li>Go游戏实战教程（制作中）详情介绍请看<a href="/pay/game.md">go游戏实战教程详细介绍</a>了解</li><li>码神MQ（从零开发MQ中间件 制作中）</li><li>能造轮子的尽量都造一遍…</li><li>如果想多个套餐一起买，可以看<a href="/pay/tc.md">套餐组合优惠详细介绍</a></li></ul>
</li><li><strong>终身会员(即将涨价)</strong><ul>
<li>买断制，所有已出和未出的付费课程和项目</li><li>终身会员服务，终身答疑指导</li><li>一对一模拟面试</li><li>等等</li></ul>
</li><li><strong>go开发Offer收割社群</strong> <ul>
<li>Go全套资料，包含学习，面试真题等等</li><li>一对一模拟面试，多次</li><li>模拟面试通过可获内推，跟踪整个流程</li><li>终身服务</li><li>详情介绍请看<a href="/pay/go.md">go开发offer收割社群详细介绍</a>了解</li></ul>
</li></ul>
<blockquote>
<p>如有意向，可联系我了解详情</p>
</blockquote>
<p><img src="./img/image-20220215214357342.png" alt="image-20220215214357342"></p>
', '
> 现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。



针对现今行业的现状，程序员面临的三个大问题：

* **学习**

  学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为`无效学习`。

* **进阶**

  因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。

  不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。

  上述的这些情况，我称为是`迷途的羔羊`。

* **面试**

  面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。

  面试靠什么？

  一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。

  二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。

  三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。

  四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。

  机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。

  这种情况我称为`战前准备不足`



> 针对以上情况，提供了一些核心服务

* **会员服务(一年期)**
  * 任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止
  * 任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等
  * 详情介绍请看[会员服务详细介绍](/pay/vip.md)了解
* **进阶付费课程**
  * 码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看[码神学堂项目实战教程详细介绍](/pay/xt.md)了解
  * 码神RPC（从零开发一个RPC框架） 详情介绍请看[码神RPC详细介绍](/pay/rpc.md)了解
  * 码神Spring（从零开发一个Spring框架）详情介绍请看[码神Spring详细介绍](/pay/spring.md)了解
  * 架构师课程-全面认知技术世界（制作中）详情介绍请看[架构师课程详细介绍](/pay/svip.md)了解
    * 第一篇章-全面认识计算机
    * 第二篇章-全面认识语言
    * 第三篇章-全面认识架构
  * Go游戏实战教程（制作中）详情介绍请看[go游戏实战教程详细介绍](/pay/game.md)了解
  * 码神MQ（从零开发MQ中间件 制作中）
  * 能造轮子的尽量都造一遍...
  * 如果想多个套餐一起买，可以看[套餐组合优惠详细介绍](/pay/tc.md)
* **终身会员(即将涨价)**
  * 买断制，所有已出和未出的付费课程和项目
  * 终身会员服务，终身答疑指导
  * 一对一模拟面试
  * 等等
* **go开发Offer收割社群** 
  * Go全套资料，包含学习，面试真题等等
  * 一对一模拟面试，多次
  * 模拟面试通过可获内推，跟踪整个流程
  * 终身服务
  * 详情介绍请看[go开发offer收割社群详细介绍](/pay/go.md)了解

> 如有意向，可联系我了解详情

![image-20220215214357342](./img/image-20220215214357342.png)

', 1, 1, 0, 0, '', '2022-02-18 12:19:38', '2022-02-18 12:19:38');
INSERT INTO goblog.blog_post (pid, title, content, markdown, category_id, user_id, view_count, type, slug, create_at, update_at) VALUES (26, 'go博客实战9999', '<blockquote>
<p>现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。</p>
</blockquote>
<p>针对现今行业的现状，程序员面临的三个大问题：</p>
<ul>
<li><p><strong>学习</strong></p>
<p>学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为<code>无效学习</code>。</p>
</li><li><p><strong>进阶</strong></p>
<p>因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。</p>
<p>不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。</p>
<p>上述的这些情况，我称为是<code>迷途的羔羊</code>。</p>
</li><li><p><strong>面试</strong></p>
<p>面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。</p>
<p>面试靠什么？</p>
<p>一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。</p>
<p>二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。</p>
<p>三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。</p>
<p>四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。</p>
<p>机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。</p>
<p>这种情况我称为<code>战前准备不足</code></p>
</li></ul>
<blockquote>
<p>针对以上情况，提供了一些核心服务</p>
</blockquote>
<ul>
<li><strong>会员服务(一年期)</strong><ul>
<li>任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止</li><li>任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等</li><li>详情介绍请看<a href="/pay/vip.md">会员服务详细介绍</a>了解</li></ul>
</li><li><strong>进阶付费课程</strong><ul>
<li>码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看<a href="/pay/xt.md">码神学堂项目实战教程详细介绍</a>了解</li><li>码神RPC（从零开发一个RPC框架） 详情介绍请看<a href="/pay/rpc.md">码神RPC详细介绍</a>了解</li><li>码神Spring（从零开发一个Spring框架）详情介绍请看<a href="/pay/spring.md">码神Spring详细介绍</a>了解</li><li>架构师课程-全面认知技术世界（制作中）详情介绍请看<a href="/pay/svip.md">架构师课程详细介绍</a>了解<ul>
<li>第一篇章-全面认识计算机</li><li>第二篇章-全面认识语言</li><li>第三篇章-全面认识架构</li></ul>
</li><li>Go游戏实战教程（制作中）详情介绍请看<a href="/pay/game.md">go游戏实战教程详细介绍</a>了解</li><li>码神MQ（从零开发MQ中间件 制作中）</li><li>能造轮子的尽量都造一遍…</li><li>如果想多个套餐一起买，可以看<a href="/pay/tc.md">套餐组合优惠详细介绍</a></li></ul>
</li><li><strong>终身会员(即将涨价)</strong><ul>
<li>买断制，所有已出和未出的付费课程和项目</li><li>终身会员服务，终身答疑指导</li><li>一对一模拟面试</li><li>等等</li></ul>
</li><li><strong>go开发Offer收割社群</strong> <ul>
<li>Go全套资料，包含学习，面试真题等等</li><li>一对一模拟面试，多次</li><li>模拟面试通过可获内推，跟踪整个流程</li><li>终身服务</li><li>详情介绍请看<a href="/pay/go.md">go开发offer收割社群详细介绍</a>了解</li></ul>
</li></ul>
<blockquote>
<p>如有意向，可联系我了解详情</p>
</blockquote>
<p><img src="./img/image-20220215214357342.png" alt="image-20220215214357342"></p>
', '
> 现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。



针对现今行业的现状，程序员面临的三个大问题：

* **学习**

  学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为`无效学习`。

* **进阶**

  因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。

  不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。

  上述的这些情况，我称为是`迷途的羔羊`。

* **面试**

  面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。

  面试靠什么？

  一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。

  二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。

  三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。

  四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。

  机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。

  这种情况我称为`战前准备不足`



> 针对以上情况，提供了一些核心服务

* **会员服务(一年期)**
  * 任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止
  * 任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等
  * 详情介绍请看[会员服务详细介绍](/pay/vip.md)了解
* **进阶付费课程**
  * 码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看[码神学堂项目实战教程详细介绍](/pay/xt.md)了解
  * 码神RPC（从零开发一个RPC框架） 详情介绍请看[码神RPC详细介绍](/pay/rpc.md)了解
  * 码神Spring（从零开发一个Spring框架）详情介绍请看[码神Spring详细介绍](/pay/spring.md)了解
  * 架构师课程-全面认知技术世界（制作中）详情介绍请看[架构师课程详细介绍](/pay/svip.md)了解
    * 第一篇章-全面认识计算机
    * 第二篇章-全面认识语言
    * 第三篇章-全面认识架构
  * Go游戏实战教程（制作中）详情介绍请看[go游戏实战教程详细介绍](/pay/game.md)了解
  * 码神MQ（从零开发MQ中间件 制作中）
  * 能造轮子的尽量都造一遍...
  * 如果想多个套餐一起买，可以看[套餐组合优惠详细介绍](/pay/tc.md)
* **终身会员(即将涨价)**
  * 买断制，所有已出和未出的付费课程和项目
  * 终身会员服务，终身答疑指导
  * 一对一模拟面试
  * 等等
* **go开发Offer收割社群** 
  * Go全套资料，包含学习，面试真题等等
  * 一对一模拟面试，多次
  * 模拟面试通过可获内推，跟踪整个流程
  * 终身服务
  * 详情介绍请看[go开发offer收割社群详细介绍](/pay/go.md)了解

> 如有意向，可联系我了解详情

![image-20220215214357342](./img/image-20220215214357342.png)

', 1, 1, 0, 0, '', '2022-02-18 12:19:46', '2022-02-18 12:19:46');
INSERT INTO goblog.blog_post (pid, title, content, markdown, category_id, user_id, view_count, type, slug, create_at, update_at) VALUES (27, 'go博客实战1000123', '<blockquote>
<p>现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。</p>
</blockquote>
<p>针对现今行业的现状，程序员面临的三个大问题：</p>
<ul>
<li><p><strong>学习</strong></p>
<p>学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为<code>无效学习</code>。</p>
</li><li><p><strong>进阶</strong></p>
<p>因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。</p>
<p>不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。</p>
<p>上述的这些情况，我称为是<code>迷途的羔羊</code>。</p>
</li><li><p><strong>面试</strong></p>
<p>面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。</p>
<p>面试靠什么？</p>
<p>一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。</p>
<p>二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。</p>
<p>三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。</p>
<p>四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。</p>
<p>机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。</p>
<p>这种情况我称为<code>战前准备不足</code></p>
</li></ul>
<blockquote>
<p>针对以上情况，提供了一些核心服务</p>
</blockquote>
<ul>
<li><strong>会员服务(一年期)</strong><ul>
<li>任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止</li><li>任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等</li><li>详情介绍请看<a href="/pay/vip.md">会员服务详细介绍</a>了解</li></ul>
</li><li><strong>进阶付费课程</strong><ul>
<li>码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看<a href="/pay/xt.md">码神学堂项目实战教程详细介绍</a>了解</li><li>码神RPC（从零开发一个RPC框架） 详情介绍请看<a href="/pay/rpc.md">码神RPC详细介绍</a>了解</li><li>码神Spring（从零开发一个Spring框架）详情介绍请看<a href="/pay/spring.md">码神Spring详细介绍</a>了解</li><li>架构师课程-全面认知技术世界（制作中）详情介绍请看<a href="/pay/svip.md">架构师课程详细介绍</a>了解<ul>
<li>第一篇章-全面认识计算机</li><li>第二篇章-全面认识语言</li><li>第三篇章-全面认识架构</li></ul>
</li><li>Go游戏实战教程（制作中）详情介绍请看<a href="/pay/game.md">go游戏实战教程详细介绍</a>了解</li><li>码神MQ（从零开发MQ中间件 制作中）</li><li>能造轮子的尽量都造一遍…</li><li>如果想多个套餐一起买，可以看<a href="/pay/tc.md">套餐组合优惠详细介绍</a></li></ul>
</li><li><strong>终身会员(即将涨价)</strong><ul>
<li>买断制，所有已出和未出的付费课程和项目</li><li>终身会员服务，终身答疑指导</li><li>一对一模拟面试</li><li>等等</li></ul>
</li><li><strong>go开发Offer收割社群</strong> <ul>
<li>Go全套资料，包含学习，面试真题等等</li><li>一对一模拟面试，多次</li><li>模拟面试通过可获内推，跟踪整个流程</li><li>终身服务</li><li>详情介绍请看<a href="/pay/go.md">go开发offer收割社群详细介绍</a>了解</li></ul>
</li></ul>
<blockquote>
<p>如有意向，可联系我了解详情</p>
</blockquote>
<p><img src="./img/image-20220215214357342.png" alt="image-20220215214357342"></p>
', '
> 现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。



针对现今行业的现状，程序员面临的三个大问题：

* **学习**

  学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为`无效学习`。

* **进阶**

  因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。

  不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。

  上述的这些情况，我称为是`迷途的羔羊`。

* **面试**

  面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。

  面试靠什么？

  一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。

  二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。

  三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。

  四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。

  机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。

  这种情况我称为`战前准备不足`



> 针对以上情况，提供了一些核心服务

* **会员服务(一年期)**
  * 任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止
  * 任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等
  * 详情介绍请看[会员服务详细介绍](/pay/vip.md)了解
* **进阶付费课程**
  * 码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看[码神学堂项目实战教程详细介绍](/pay/xt.md)了解
  * 码神RPC（从零开发一个RPC框架） 详情介绍请看[码神RPC详细介绍](/pay/rpc.md)了解
  * 码神Spring（从零开发一个Spring框架）详情介绍请看[码神Spring详细介绍](/pay/spring.md)了解
  * 架构师课程-全面认知技术世界（制作中）详情介绍请看[架构师课程详细介绍](/pay/svip.md)了解
    * 第一篇章-全面认识计算机
    * 第二篇章-全面认识语言
    * 第三篇章-全面认识架构
  * Go游戏实战教程（制作中）详情介绍请看[go游戏实战教程详细介绍](/pay/game.md)了解
  * 码神MQ（从零开发MQ中间件 制作中）
  * 能造轮子的尽量都造一遍...
  * 如果想多个套餐一起买，可以看[套餐组合优惠详细介绍](/pay/tc.md)
* **终身会员(即将涨价)**
  * 买断制，所有已出和未出的付费课程和项目
  * 终身会员服务，终身答疑指导
  * 一对一模拟面试
  * 等等
* **go开发Offer收割社群** 
  * Go全套资料，包含学习，面试真题等等
  * 一对一模拟面试，多次
  * 模拟面试通过可获内推，跟踪整个流程
  * 终身服务
  * 详情介绍请看[go开发offer收割社群详细介绍](/pay/go.md)了解

> 如有意向，可联系我了解详情

![image-20220215214357342](./img/image-20220215214357342.png)

', 1, 1, 0, 0, '', '2022-02-18 12:19:54', '2022-02-18 12:19:54');
INSERT INTO goblog.blog_post (pid, title, content, markdown, category_id, user_id, view_count, type, slug, create_at, update_at) VALUES (28, 'go博客实战111111111', '<blockquote>
<p>现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。</p>
</blockquote>
<p>针对现今行业的现状，程序员面临的三个大问题：</p>
<ul>
<li><p><strong>学习</strong></p>
<p>学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为<code>无效学习</code>。</p>
</li><li><p><strong>进阶</strong></p>
<p>因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。</p>
<p>不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。</p>
<p>上述的这些情况，我称为是<code>迷途的羔羊</code>。</p>
</li><li><p><strong>面试</strong></p>
<p>面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。</p>
<p>面试靠什么？</p>
<p>一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。</p>
<p>二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。</p>
<p>三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。</p>
<p>四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。</p>
<p>机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。</p>
<p>这种情况我称为<code>战前准备不足</code></p>
</li></ul>
<blockquote>
<p>针对以上情况，提供了一些核心服务</p>
</blockquote>
<ul>
<li><strong>会员服务(一年期)</strong><ul>
<li>任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止</li><li>任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等</li><li>详情介绍请看<a href="/pay/vip.md">会员服务详细介绍</a>了解</li></ul>
</li><li><strong>进阶付费课程</strong><ul>
<li>码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看<a href="/pay/xt.md">码神学堂项目实战教程详细介绍</a>了解</li><li>码神RPC（从零开发一个RPC框架） 详情介绍请看<a href="/pay/rpc.md">码神RPC详细介绍</a>了解</li><li>码神Spring（从零开发一个Spring框架）详情介绍请看<a href="/pay/spring.md">码神Spring详细介绍</a>了解</li><li>架构师课程-全面认知技术世界（制作中）详情介绍请看<a href="/pay/svip.md">架构师课程详细介绍</a>了解<ul>
<li>第一篇章-全面认识计算机</li><li>第二篇章-全面认识语言</li><li>第三篇章-全面认识架构</li></ul>
</li><li>Go游戏实战教程（制作中）详情介绍请看<a href="/pay/game.md">go游戏实战教程详细介绍</a>了解</li><li>码神MQ（从零开发MQ中间件 制作中）</li><li>能造轮子的尽量都造一遍…</li><li>如果想多个套餐一起买，可以看<a href="/pay/tc.md">套餐组合优惠详细介绍</a></li></ul>
</li><li><strong>终身会员(即将涨价)</strong><ul>
<li>买断制，所有已出和未出的付费课程和项目</li><li>终身会员服务，终身答疑指导</li><li>一对一模拟面试</li><li>等等</li></ul>
</li><li><strong>go开发Offer收割社群</strong> <ul>
<li>Go全套资料，包含学习，面试真题等等</li><li>一对一模拟面试，多次</li><li>模拟面试通过可获内推，跟踪整个流程</li><li>终身服务</li><li>详情介绍请看<a href="/pay/go.md">go开发offer收割社群详细介绍</a>了解</li></ul>
</li></ul>
<blockquote>
<p>如有意向，可联系我了解详情</p>
</blockquote>
<p><img src="./img/image-20220215214357342.png" alt="image-20220215214357342"></p>
', '
> 现今互联网已经深入人们的生活，各种知识爆炸式袭来，随着行业的成熟以及学历人群的大幅度提升，随之而来的要求也越发提高，如果想要更加深入的学习提升，在激烈的竞争环境中脱颖而出，知识付费成为一个新的选择，知识是有价的，核心的高质量的课程和服务永远不可能免费。



针对现今行业的现状，程序员面临的三个大问题：

* **学习**

  学习上面临的问题是无人指导，解决问题一靠百度，二靠问人，三靠自己琢磨，虽然最终可能会解决，但耗费了大量的时间，同时问题虽然解决了，但有时候根本不知道为什么？那么解决问题，还有意义吗？我将这种情况称为`无效学习`。

* **进阶**

  因为现在的岗位要求越来越高，针对的技能亮点，也要求更加深入，不管是实习，校招，社招遇到的问题都一样，CRUD的项目或者是无任何业务思考的项目能拿的出手吗？显然是不能。

  不管是初入职场还是工作多年的码农，都有一颗进步的心，可是职场毕竟是职场，不一定有核心的业务教给你做，然后就形成了一种恶性循环，没有核心知识和认知无法找到让自身成长的工作，而接触不到核心的业务又无法让自身掌握核心竞争力。

  上述的这些情况，我称为是`迷途的羔羊`。

* **面试**

  面试造火箭，工作拧螺丝，这是大家都清楚知道的，不管你技术多么厉害，面试过不去，一切都扯淡。

  面试靠什么？

  一是表达，流畅的表达，清晰的思路，给面试官留下的印象绝对深刻。

  二是简历，简历是获得面试机会的唯一入口，如何写一个好的简历，关乎生死。

  三是八股文，八股文都不会，自然不会更深入的和你谈，面试官的时间也很金贵。

  四是真实经验，没有实际做过，你吹牛逼的时候，面试官是否总露出一丝淡淡的笑意看着你。

  机会总是很有限，准备不足，面试效果自然很差，或者有人心态直接就崩了。

  这种情况我称为`战前准备不足`



> 针对以上情况，提供了一些核心服务

* **会员服务(一年期)**
  * 任意问题的答疑指导服务，一对一，24小时在线的导师，解答满意为止
  * 任意问题举例，比如日常学习疑惑，bug解决，工作问题，简历修改，面试指导，offer选择等等
  * 详情介绍请看[会员服务详细介绍](/pay/vip.md)了解
* **进阶付费课程**
  * 码神学堂（真实项目实战教程，无惧面试，非DEMO项目）详情介绍请看[码神学堂项目实战教程详细介绍](/pay/xt.md)了解
  * 码神RPC（从零开发一个RPC框架） 详情介绍请看[码神RPC详细介绍](/pay/rpc.md)了解
  * 码神Spring（从零开发一个Spring框架）详情介绍请看[码神Spring详细介绍](/pay/spring.md)了解
  * 架构师课程-全面认知技术世界（制作中）详情介绍请看[架构师课程详细介绍](/pay/svip.md)了解
    * 第一篇章-全面认识计算机
    * 第二篇章-全面认识语言
    * 第三篇章-全面认识架构
  * Go游戏实战教程（制作中）详情介绍请看[go游戏实战教程详细介绍](/pay/game.md)了解
  * 码神MQ（从零开发MQ中间件 制作中）
  * 能造轮子的尽量都造一遍...
  * 如果想多个套餐一起买，可以看[套餐组合优惠详细介绍](/pay/tc.md)
* **终身会员(即将涨价)**
  * 买断制，所有已出和未出的付费课程和项目
  * 终身会员服务，终身答疑指导
  * 一对一模拟面试
  * 等等
* **go开发Offer收割社群** 
  * Go全套资料，包含学习，面试真题等等
  * 一对一模拟面试，多次
  * 模拟面试通过可获内推，跟踪整个流程
  * 终身服务
  * 详情介绍请看[go开发offer收割社群详细介绍](/pay/go.md)了解

> 如有意向，可联系我了解详情

![image-20220215214357342](./img/image-20220215214357342.png)

', 1, 1, 0, 0, '', '2022-02-18 12:20:06', '2022-02-18 12:20:06');
